In [214]:
# import libraries
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [215]:
path = r"C:\Users\andyc\Job Salary Analysis"

In [216]:
Salary = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'Salary_Data_Based_country_and_race.csv'))

In [217]:
Salary.head()

,Unnamed: 0,Age,Gender,Education Level,Job Title,Years of Experience,Salary,Country,Race
0,0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0,United Kingdom,White
1,1,28.0,Female,Master's,Data Analyst,3.0,65000.0,United States of America,Hispanic
2,2,45.0,Male,PhD,Senior Manager,15.0,150000.0,Canada,White
3,3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0,United States of America,Hispanic
4,4,52.0,Male,Master's,Director,20.0,200000.0,United States of America,Asian

In [218]:
#checking the rows and columns
Salary.shape

(6704, 9)

In [219]:
#applying descriptive statistics
Salary.describe()

        Unnamed: 0          Age  Years of Experience         Salary
count  6704.000000  6702.000000          6701.000000    6699.000000
mean   3351.500000    33.620859             8.094687  115326.964771
std    1935.422435     7.614633             6.059003   52786.183911
min       0.000000    21.000000             0.000000     350.000000
25%    1675.750000    28.000000             3.000000   70000.000000
50%    3351.500000    32.000000             7.000000  115000.000000
75%    5027.250000    38.000000            12.000000  160000.000000
max    6703.000000    62.000000            34.000000  250000.000000

In [220]:
#checking data types
Salary.dtypes

Unnamed: 0               int64
Age                    float64
Gender                  object
Education Level         object
Job Title               object
Years of Experience    float64
Salary                 float64
Country                 object
Race                    object
dtype: object

In [221]:
#finding missing values 
Salary.isnull().sum()

Unnamed: 0             0
Age                    2
Gender                 2
Education Level        3
Job Title              2
Years of Experience    3
Salary                 5
Country                0
Race                   0
dtype: int64

In [222]:
#creates a subset that provides all the missing values in the Salary column
salary_missing_values = Salary[Salary['Salary'].isnull() == True]

In [223]:
salary_missing_values

,Unnamed: 0,Age,Gender,Education Level,Job Title,Years of Experience,Salary,Country,Race
172,172,NaN,NaN,NaN,NaN,NaN,NaN,United Kingdom,White
260,260,NaN,NaN,NaN,NaN,NaN,NaN,Canada,White
3136,3136,31.0,Male,Master's Degree,Full Stack Engineer,8.0,NaN,Canada,White
5247,5247,26.0,Female,Bachelor's Degree,Social M,NaN,NaN,United States of America,White
6455,6455,36.0,Male,Bachelor's Degree,Sales Director,6.0,NaN,Canada,White

In [224]:
#Dropping the rows with NaN values in the Age Column.
Salary.dropna(subset=['Age'], inplace=True)

In [225]:
salary_missing_values

,Unnamed: 0,Age,Gender,Education Level,Job Title,Years of Experience,Salary,Country,Race
172,172,NaN,NaN,NaN,NaN,NaN,NaN,United Kingdom,White
260,260,NaN,NaN,NaN,NaN,NaN,NaN,Canada,White
3136,3136,31.0,Male,Master's Degree,Full Stack Engineer,8.0,NaN,Canada,White
5247,5247,26.0,Female,Bachelor's Degree,Social M,NaN,NaN,United States of America,White
6455,6455,36.0,Male,Bachelor's Degree,Sales Director,6.0,NaN,Canada,White

After doing some research on a Full Stack Engineer with a Master's Degree and 8 Years of Experience, I found out they make around $198,000 annually.

After doing some research on a Sales Director with a Bachelor's Degree and 6 Years of Experience, I found out they make around $85,000 annually.

In [228]:
#Imputing the NaN value with the 198000 in row 3136 for the Salary Column.
Salary.loc[3136, 'Salary'] = 198000

In [229]:
#checking the results on the imputation
print(Salary.iloc[3134])

Unnamed: 0                            3136
Age                                   31.0
Gender                                Male
Education Level            Master's Degree
Job Title              Full Stack Engineer
Years of Experience                    8.0
Salary                            198000.0
Country                             Canada
Race                                 White
Name: 3136, dtype: object

In [230]:
#Imputing the NaN value with the 85000 in row 6455 for the Salary Column.
Salary.loc[6455, 'Salary'] = 85000

In [231]:
#checking the results on the imputation
print(Salary.iloc[6453])

Unnamed: 0                          6455
Age                                 36.0
Gender                              Male
Education Level        Bachelor's Degree
Job Title                 Sales Director
Years of Experience                  6.0
Salary                           85000.0
Country                           Canada
Race                               White
Name: 6455, dtype: object

I imputed the Years of Experience median(7) into the NaN for row 5247 and based the salary off of that.

After doing some research on a Social Manager with a Bachelor's Degree and 7 Years of Experience, I found out they make around $90,000 annually.

In [234]:
#Imputing the NaN value with the 7 in row 5247 for the Years of Experience Column.
Salary.loc[5247, 'Years of Experience'] = 7

In [235]:
#Imputing the NaN value with the 90000 in row 5247 for the Salary Column.
Salary.loc[5247, 'Salary'] = 90000

In [236]:
#checking the results on the imputation
print(Salary.iloc[5245])

Unnamed: 0                                 5247
Age                                        26.0
Gender                                   Female
Education Level               Bachelor's Degree
Job Title                              Social M
Years of Experience                         7.0
Salary                                  90000.0
Country                United States of America
Race                                      White
Name: 5247, dtype: object

In [237]:
#checking for anymore missing values 
Salary.isnull().sum()

Unnamed: 0             0
Age                    0
Gender                 0
Education Level        1
Job Title              0
Years of Experience    0
Salary                 0
Country                0
Race                   0
dtype: int64

In [238]:
#creates a subset that provides all the missing values in the Education Level column
edu_missing_values = Salary[Salary['Education Level'].isnull() == True]

In [239]:
edu_missing_values

,Unnamed: 0,Age,Gender,Education Level,Job Title,Years of Experience,Salary,Country,Race
2011,2011,27.0,Male,NaN,Developer,7.0,100000.0,United Kingdom,White

After doing some extensive research, I found that a developer with 7 years of experience needs a minimum of a Bachelor's degree to be making $100,000 annually.

In [241]:
#Imputing the NaN value with the 'Bachelor's Degree' in the Education Level Column.
Salary.loc[Salary['Education Level'].isna(), 'Education Level'] = "Bachelor's Degree"

In [242]:
#checking the results on the imputation
print(Salary.iloc[2009])

Unnamed: 0                          2011
Age                                 27.0
Gender                              Male
Education Level        Bachelor's Degree
Job Title                      Developer
Years of Experience                  7.0
Salary                          100000.0
Country                   United Kingdom
Race                               White
Name: 2011, dtype: object

In [243]:
#checking for anymore missing values 
Salary.isnull().sum()

Unnamed: 0             0
Age                    0
Gender                 0
Education Level        0
Job Title              0
Years of Experience    0
Salary                 0
Country                0
Race                   0
dtype: int64

In [244]:
#descriptive statistics after filling in missing values
Salary.describe()

        Unnamed: 0          Age  Years of Experience        Salary
count  6702.000000  6702.000000          6702.000000    6702.00000
mean   3352.435691    33.620859             8.094524  115330.99627
std    1934.952777     7.614633             6.058566   52786.23587
min       0.000000    21.000000             0.000000     350.00000
25%    1677.250000    28.000000             3.000000   70000.00000
50%    3352.500000    32.000000             7.000000  115000.00000
75%    5027.750000    38.000000            12.000000  160000.00000
max    6703.000000    62.000000            34.000000  250000.00000

In [245]:
#looks for full duplicates in the dataframe
Salary_dups = Salary[Salary.duplicated()]

In [246]:
Salary_dups

Empty DataFrame
Columns: [Unnamed: 0, Age, Gender, Education Level, Job Title, Years of Experience, Salary, Country, Race]
Index: []

There are no duplicates in our dataset.

In [248]:
#renaming the Unnamed: 0 column to the appropriate name, ID
Salary.rename(columns = {'Unnamed: 0' : 'ID'}, inplace = True)

In [249]:
Salary.head()

,ID,Age,Gender,Education Level,Job Title,Years of Experience,Salary,Country,Race
0,0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0,United Kingdom,White
1,1,28.0,Female,Master's,Data Analyst,3.0,65000.0,United States of America,Hispanic
2,2,45.0,Male,PhD,Senior Manager,15.0,150000.0,Canada,White
3,3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0,United States of America,Hispanic
4,4,52.0,Male,Master's,Director,20.0,200000.0,United States of America,Asian

In [250]:
#descriptive statistics
Salary.describe()

                ID          Age  Years of Experience        Salary
count  6702.000000  6702.000000          6702.000000    6702.00000
mean   3352.435691    33.620859             8.094524  115330.99627
std    1934.952777     7.614633             6.058566   52786.23587
min       0.000000    21.000000             0.000000     350.00000
25%    1677.250000    28.000000             3.000000   70000.00000
50%    3352.500000    32.000000             7.000000  115000.00000
75%    5027.750000    38.000000            12.000000  160000.00000
max    6703.000000    62.000000            34.000000  250000.00000

In [251]:
#exporting data, salary to csv file.
Salary.to_csv(os.path.join(path, '02 Data','Prepared Data', 'salary.csv'))